In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# import pandas as pd
# data_frame = pd.read_csv("data(1).csv")
# print(data_frame.head(3))
# print(data_frame.tail(3))

In [10]:
import pandas as pd
df=pd.read_csv('data(1).csv')

In [11]:
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [12]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [15]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [16]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [18]:
df.isnull().any()

Date        False
Category    False
Value        True
Product     False
Sales        True
Region      False
dtype: bool

In [19]:
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [22]:
df_filled = df.fillna(0)
# print(df_filled)

In [26]:
df["Sales_fillna"]= df["Sales"].fillna(df["Sales"].mean())
# print(df)

In [28]:
df = df.rename(columns={"Date":"Sales Date"})
df.head()

   Sales Date Category  Value   Product  Sales Region  Sales_fillna
0  2023-01-01        A   28.0  Product1  754.0   East         754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0

In [33]:
df["newValue"]=df["Value"].fillna(df["Value"].mean()).astype(int)
# print(df)

In [41]:
df["SqNewValue"]= df["Value"].apply(lambda x:x*2)
# print(df.tail())
# df.head()

In [45]:
grouped_mean = df.groupby("Product")["Value"].mean()
# print(grouped_mean)

In [46]:
gM = df.groupby("Region")["Value"].mean()
# print(gM)

In [49]:
gM = df.groupby("Region")["Value"].sum()
# print(gM)

In [56]:
twoGroupedSum = df.groupby(["Product","Region"])["Value"].sum()
# print(twoGroupedSum)

In [58]:
gm = df.groupby("Region")["Value"].agg(["mean","sum","count"])
# print(gm)

In [ ]:
df1 = pd.DataFrame({"key":["a",'b','c'],"value":[1, 3, 4]})
df2 = pd.DataFrame({"key":["d",'b','f'],"value":[8, 2, 9]})
# print(df1)
# print(df2)
merge = pd.merge(df1,df2,on="key",how="inner")
print(merge)

Empty DataFrame
Columns: [key, value_x, value_y]
Index: []

In [67]:
pd.merge(df1,df2,on="key",how="inner")

Empty DataFrame
Columns: [key, value_x, value_y]
Index: []

In [68]:
pd.merge(df1,df2,on="key",how="outer")

  key  value_x  value_y
0   a      1.0      NaN
1   b      3.0      NaN
2   c      4.0      NaN
3   d      NaN      8.0
4   e      NaN      2.0
5   f      NaN      9.0

In [69]:
pd.merge(df1,df2,on="key",how="left")

  key  value_x  value_y
0   a        1      NaN
1   b        3      NaN
2   c        4      NaN

In [70]:
pd.merge(df1,df2,on="key",how="right")

  key  value_x  value_y
0   d      NaN        8
1   e      NaN        2
2   f      NaN        9